tutorials/fluidSolidInteraction/oneWayCavity/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidSolidInterface    oneWayCoupling;

oneWayCouplingCoeffs
{
    // Solid patch and face zone
    solidPatch interface;
    solidZone interface-zone;

    // Fluid patch and face zone
    fluidPatch fixedWalls;
    fluidZone fixedWalls-zone;
}

// ************************************************************************* //
